SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26_smu.h
/* Bit fields for SMU PPUPATD0 */
#define _SMU_PPUPATD0_RESETVALUE              0xFFFFFFFFUL                              /**< Default value for SMU_PPUPATD0              */
#define _SMU_PPUPATD0_MASK                    0xFFFFFFFFUL                              /**< Mask for SMU_PPUPATD0                       */
#define SMU_PPUPATD0_EMU                      (0x1UL << 1)                              /**< EMU Privileged Access                       */
#define _SMU_PPUPATD0_EMU_SHIFT               1                                         /**< Shift value for SMU_EMU                     */
#define _SMU_PPUPATD0_EMU_MASK                0x2UL                                     /**< Bit mask for SMU_EMU                        */
#define _SMU_PPUPATD0_EMU_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_EMU_DEFAULT              (_SMU_PPUPATD0_EMU_DEFAULT << 1)          /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_CMU                      (0x1UL << 2)                              /**< CMU Privileged Access                       */
#define _SMU_PPUPATD0_CMU_SHIFT               2                                         /**< Shift value for SMU_CMU                     */
#define _SMU_PPUPATD0_CMU_MASK                0x4UL                                     /**< Bit mask for SMU_CMU                        */
#define _SMU_PPUPATD0_CMU_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_CMU_DEFAULT              (_SMU_PPUPATD0_CMU_DEFAULT << 2)          /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_BURTC                    (0x1UL << 3)                              /**< BURTC Privileged Access                     */
#define _SMU_PPUPATD0_BURTC_SHIFT             3                                         /**< Shift value for SMU_BURTC                   */
#define _SMU_PPUPATD0_BURTC_MASK              0x8UL                                     /**< Bit mask for SMU_BURTC                      */
#define _SMU_PPUPATD0_BURTC_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_BURTC_DEFAULT            (_SMU_PPUPATD0_BURTC_DEFAULT << 3)        /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_HFRCO0                   (0x1UL << 4)                              /**< HFRCO0 Privileged Access                    */
#define _SMU_PPUPATD0_HFRCO0_SHIFT            4                                         /**< Shift value for SMU_HFRCO0                  */
#define _SMU_PPUPATD0_HFRCO0_MASK             0x10UL                                    /**< Bit mask for SMU_HFRCO0                     */
#define _SMU_PPUPATD0_HFRCO0_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_HFRCO0_DEFAULT           (_SMU_PPUPATD0_HFRCO0_DEFAULT << 4)       /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_FSRCO                    (0x1UL << 5)                              /**< FSRCO Privileged Access                     */
#define _SMU_PPUPATD0_FSRCO_SHIFT             5                                         /**< Shift value for SMU_FSRCO                   */
#define _SMU_PPUPATD0_FSRCO_MASK              0x20UL                                    /**< Bit mask for SMU_FSRCO                      */
#define _SMU_PPUPATD0_FSRCO_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_FSRCO_DEFAULT            (_SMU_PPUPATD0_FSRCO_DEFAULT << 5)        /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_DPLL0                    (0x1UL << 6)                              /**< DPLL0 Privileged Access                     */
#define _SMU_PPUPATD0_DPLL0_SHIFT             6                                         /**< Shift value for SMU_DPLL0                   */
#define _SMU_PPUPATD0_DPLL0_MASK              0x40UL                                    /**< Bit mask for SMU_DPLL0                      */
#define _SMU_PPUPATD0_DPLL0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_DPLL0_DEFAULT            (_SMU_PPUPATD0_DPLL0_DEFAULT << 6)        /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_LFXO                     (0x1UL << 7)                              /**< LFXO Privileged Access                      */
#define _SMU_PPUPATD0_LFXO_SHIFT              7                                         /**< Shift value for SMU_LFXO                    */
#define _SMU_PPUPATD0_LFXO_MASK               0x80UL                                    /**< Bit mask for SMU_LFXO                       */
#define _SMU_PPUPATD0_LFXO_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_LFXO_DEFAULT             (_SMU_PPUPATD0_LFXO_DEFAULT << 7)         /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_LFRCO                    (0x1UL << 8)                              /**< LFRCO Privileged Access                     */
#define _SMU_PPUPATD0_LFRCO_SHIFT             8                                         /**< Shift value for SMU_LFRCO                   */
#define _SMU_PPUPATD0_LFRCO_MASK              0x100UL                                   /**< Bit mask for SMU_LFRCO                      */
#define _SMU_PPUPATD0_LFRCO_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_LFRCO_DEFAULT            (_SMU_PPUPATD0_LFRCO_DEFAULT << 8)        /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_ULFRCO                   (0x1UL << 9)                              /**< ULFRCO Privileged Access                    */
#define _SMU_PPUPATD0_ULFRCO_SHIFT            9                                         /**< Shift value for SMU_ULFRCO                  */
#define _SMU_PPUPATD0_ULFRCO_MASK             0x200UL                                   /**< Bit mask for SMU_ULFRCO                     */
#define _SMU_PPUPATD0_ULFRCO_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_ULFRCO_DEFAULT           (_SMU_PPUPATD0_ULFRCO_DEFAULT << 9)       /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_KEYSCAN                  (0x1UL << 10)                             /**< KEYSCAN Privileged Access                   */
#define _SMU_PPUPATD0_KEYSCAN_SHIFT           10                                        /**< Shift value for SMU_KEYSCAN                 */
#define _SMU_PPUPATD0_KEYSCAN_MASK            0x400UL                                   /**< Bit mask for SMU_KEYSCAN                    */
#define _SMU_PPUPATD0_KEYSCAN_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_KEYSCAN_DEFAULT          (_SMU_PPUPATD0_KEYSCAN_DEFAULT << 10)     /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_MSC                      (0x1UL << 11)                             /**< MSC Privileged Access                       */
#define _SMU_PPUPATD0_MSC_SHIFT               11                                        /**< Shift value for SMU_MSC                     */
#define _SMU_PPUPATD0_MSC_MASK                0x800UL                                   /**< Bit mask for SMU_MSC                        */
#define _SMU_PPUPATD0_MSC_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_MSC_DEFAULT              (_SMU_PPUPATD0_MSC_DEFAULT << 11)         /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_ICACHE0                  (0x1UL << 12)                             /**< ICACHE0 Privileged Access                   */
#define _SMU_PPUPATD0_ICACHE0_SHIFT           12                                        /**< Shift value for SMU_ICACHE0                 */
#define _SMU_PPUPATD0_ICACHE0_MASK            0x1000UL                                  /**< Bit mask for SMU_ICACHE0                    */
#define _SMU_PPUPATD0_ICACHE0_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_ICACHE0_DEFAULT          (_SMU_PPUPATD0_ICACHE0_DEFAULT << 12)     /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_PRS                      (0x1UL << 13)                             /**< PRS Privileged Access                       */
#define _SMU_PPUPATD0_PRS_SHIFT               13                                        /**< Shift value for SMU_PRS                     */
#define _SMU_PPUPATD0_PRS_MASK                0x2000UL                                  /**< Bit mask for SMU_PRS                        */
#define _SMU_PPUPATD0_PRS_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_PRS_DEFAULT              (_SMU_PPUPATD0_PRS_DEFAULT << 13)         /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_GPIO                     (0x1UL << 14)                             /**< GPIO Privileged Access                      */
#define _SMU_PPUPATD0_GPIO_SHIFT              14                                        /**< Shift value for SMU_GPIO                    */
#define _SMU_PPUPATD0_GPIO_MASK               0x4000UL                                  /**< Bit mask for SMU_GPIO                       */
#define _SMU_PPUPATD0_GPIO_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_GPIO_DEFAULT             (_SMU_PPUPATD0_GPIO_DEFAULT << 14)        /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_LDMA                     (0x1UL << 15)                             /**< LDMA Privileged Access                      */
#define _SMU_PPUPATD0_LDMA_SHIFT              15                                        /**< Shift value for SMU_LDMA                    */
#define _SMU_PPUPATD0_LDMA_MASK               0x8000UL                                  /**< Bit mask for SMU_LDMA                       */
#define _SMU_PPUPATD0_LDMA_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_LDMA_DEFAULT             (_SMU_PPUPATD0_LDMA_DEFAULT << 15)        /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_LDMAXBAR                 (0x1UL << 16)                             /**< LDMAXBAR Privileged Access                  */
#define _SMU_PPUPATD0_LDMAXBAR_SHIFT          16                                        /**< Shift value for SMU_LDMAXBAR                */
#define _SMU_PPUPATD0_LDMAXBAR_MASK           0x10000UL                                 /**< Bit mask for SMU_LDMAXBAR                   */
#define _SMU_PPUPATD0_LDMAXBAR_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_LDMAXBAR_DEFAULT         (_SMU_PPUPATD0_LDMAXBAR_DEFAULT << 16)    /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER0                   (0x1UL << 17)                             /**< TIMER0 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER0_SHIFT            17                                        /**< Shift value for SMU_TIMER0                  */
#define _SMU_PPUPATD0_TIMER0_MASK             0x20000UL                                 /**< Bit mask for SMU_TIMER0                     */
#define _SMU_PPUPATD0_TIMER0_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER0_DEFAULT           (_SMU_PPUPATD0_TIMER0_DEFAULT << 17)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER1                   (0x1UL << 18)                             /**< TIMER1 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER1_SHIFT            18                                        /**< Shift value for SMU_TIMER1                  */
#define _SMU_PPUPATD0_TIMER1_MASK             0x40000UL                                 /**< Bit mask for SMU_TIMER1                     */
#define _SMU_PPUPATD0_TIMER1_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER1_DEFAULT           (_SMU_PPUPATD0_TIMER1_DEFAULT << 18)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER2                   (0x1UL << 19)                             /**< TIMER2 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER2_SHIFT            19                                        /**< Shift value for SMU_TIMER2                  */
#define _SMU_PPUPATD0_TIMER2_MASK             0x80000UL                                 /**< Bit mask for SMU_TIMER2                     */
#define _SMU_PPUPATD0_TIMER2_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER2_DEFAULT           (_SMU_PPUPATD0_TIMER2_DEFAULT << 19)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER3                   (0x1UL << 20)                             /**< TIMER3 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER3_SHIFT            20                                        /**< Shift value for SMU_TIMER3                  */
#define _SMU_PPUPATD0_TIMER3_MASK             0x100000UL                                /**< Bit mask for SMU_TIMER3                     */
#define _SMU_PPUPATD0_TIMER3_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER3_DEFAULT           (_SMU_PPUPATD0_TIMER3_DEFAULT << 20)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER4                   (0x1UL << 21)                             /**< TIMER4 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER4_SHIFT            21                                        /**< Shift value for SMU_TIMER4                  */
#define _SMU_PPUPATD0_TIMER4_MASK             0x200000UL                                /**< Bit mask for SMU_TIMER4                     */
#define _SMU_PPUPATD0_TIMER4_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER4_DEFAULT           (_SMU_PPUPATD0_TIMER4_DEFAULT << 21)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER5                   (0x1UL << 22)                             /**< TIMER5 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER5_SHIFT            22                                        /**< Shift value for SMU_TIMER5                  */
#define _SMU_PPUPATD0_TIMER5_MASK             0x400000UL                                /**< Bit mask for SMU_TIMER5                     */
#define _SMU_PPUPATD0_TIMER5_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER5_DEFAULT           (_SMU_PPUPATD0_TIMER5_DEFAULT << 22)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER6                   (0x1UL << 23)                             /**< TIMER6 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER6_SHIFT            23                                        /**< Shift value for SMU_TIMER6                  */
#define _SMU_PPUPATD0_TIMER6_MASK             0x800000UL                                /**< Bit mask for SMU_TIMER6                     */
#define _SMU_PPUPATD0_TIMER6_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER6_DEFAULT           (_SMU_PPUPATD0_TIMER6_DEFAULT << 23)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER7                   (0x1UL << 24)                             /**< TIMER7 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER7_SHIFT            24                                        /**< Shift value for SMU_TIMER7                  */
#define _SMU_PPUPATD0_TIMER7_MASK             0x1000000UL                               /**< Bit mask for SMU_TIMER7                     */
#define _SMU_PPUPATD0_TIMER7_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER7_DEFAULT           (_SMU_PPUPATD0_TIMER7_DEFAULT << 24)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER8                   (0x1UL << 25)                             /**< TIMER8 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER8_SHIFT            25                                        /**< Shift value for SMU_TIMER8                  */
#define _SMU_PPUPATD0_TIMER8_MASK             0x2000000UL                               /**< Bit mask for SMU_TIMER8                     */
#define _SMU_PPUPATD0_TIMER8_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER8_DEFAULT           (_SMU_PPUPATD0_TIMER8_DEFAULT << 25)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_TIMER9                   (0x1UL << 26)                             /**< TIMER9 Privileged Access                    */
#define _SMU_PPUPATD0_TIMER9_SHIFT            26                                        /**< Shift value for SMU_TIMER9                  */
#define _SMU_PPUPATD0_TIMER9_MASK             0x4000000UL                               /**< Bit mask for SMU_TIMER9                     */
#define _SMU_PPUPATD0_TIMER9_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_TIMER9_DEFAULT           (_SMU_PPUPATD0_TIMER9_DEFAULT << 26)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_DMEM0                    (0x1UL << 28)                             /**< DMEM0 Privileged Access                     */
#define _SMU_PPUPATD0_DMEM0_SHIFT             28                                        /**< Shift value for SMU_DMEM0                   */
#define _SMU_PPUPATD0_DMEM0_MASK              0x10000000UL                              /**< Bit mask for SMU_DMEM0                      */
#define _SMU_PPUPATD0_DMEM0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_DMEM0_DEFAULT            (_SMU_PPUPATD0_DMEM0_DEFAULT << 28)       /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_DMEM1                    (0x1UL << 29)                             /**< DMEM1 Privileged Access                     */
#define _SMU_PPUPATD0_DMEM1_SHIFT             29                                        /**< Shift value for SMU_DMEM1                   */
#define _SMU_PPUPATD0_DMEM1_MASK              0x20000000UL                              /**< Bit mask for SMU_DMEM1                      */
#define _SMU_PPUPATD0_DMEM1_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_DMEM1_DEFAULT            (_SMU_PPUPATD0_DMEM1_DEFAULT << 29)       /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_SYSCFGCFGNS              (0x1UL << 30)                             /**< SYSCFGCFGNS Privileged Access               */
#define _SMU_PPUPATD0_SYSCFGCFGNS_SHIFT       30                                        /**< Shift value for SMU_SYSCFGCFGNS             */
#define _SMU_PPUPATD0_SYSCFGCFGNS_MASK        0x40000000UL                              /**< Bit mask for SMU_SYSCFGCFGNS                */
#define _SMU_PPUPATD0_SYSCFGCFGNS_DEFAULT     0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_SYSCFGCFGNS_DEFAULT      (_SMU_PPUPATD0_SYSCFGCFGNS_DEFAULT << 30) /**< Shifted mode DEFAULT for SMU_PPUPATD0       */
#define SMU_PPUPATD0_SYSCFG                   (0x1UL << 31)                             /**< SYSCFG Privileged Access                    */
#define _SMU_PPUPATD0_SYSCFG_SHIFT            31                                        /**< Shift value for SMU_SYSCFG                  */
#define _SMU_PPUPATD0_SYSCFG_MASK             0x80000000UL                              /**< Bit mask for SMU_SYSCFG                     */
#define _SMU_PPUPATD0_SYSCFG_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD0               */
#define SMU_PPUPATD0_SYSCFG_DEFAULT           (_SMU_PPUPATD0_SYSCFG_DEFAULT << 31)      /**< Shifted mode DEFAULT for SMU_PPUPATD0       */

